# Python: pandas DataFrames

## The pandas DataFrame

In data analysis, `DataFrames` are used most frequently. These are available via the `pandas` library.  
**Task:** Execute the following cells and observe the result.

In [1]:
# First, pandas is imported and renamed to 'pd'. This is common to save typing.
import pandas as pd

# Then a two-dimensional list is created and assigned to the variable X
X = [[0, 1, 2, 3], [4, 5, 6, 7], [8, 9, 10, 11]]

# Finally, the two-dimensional list is converted into a DataFrame.
df = pd.DataFrame(X, columns=['zeroth_column', 'first_column', 'second_column', 'third_column'])

df

   zeroth_column  first_column  second_column  third_column
0              0             1              2             3
1              4             5              6             7
2              8             9             10            11

We can also add a new row or a new column to the DataFrame:

In [2]:
# insert new row with index '3'
df.loc[3] = [12, 13, 14, 15]
df

   zeroth_column  first_column  second_column  third_column
0              0             1              2             3
1              4             5              6             7
2              8             9             10            11
3             12            13             14            15

In [3]:
# insert new column with name 'fourth_column'
df['fourth_column'] = [16, 17, 18, 19]
df

   zeroth_column  first_column  second_column  third_column  fourth_column
0              0             1              2             3             16
1              4             5              6             7             17
2              8             9             10            11             18
3             12            13             14            15             19

**Task:**

1. Add another row to the DataFrame `df` with the numbers 20 to 24 as values. Display the resulting DataFrame afterwards.

In [4]:
df.loc[4] = [20, 21, 22 ,23 ,24]
df

   zeroth_column  first_column  second_column  third_column  fourth_column
0              0             1              2             3             16
1              4             5              6             7             17
2              8             9             10            11             18
3             12            13             14            15             19
4             20            21             22            23             24

2. Add another column to the DataFrame `df` with the numbers 25 to 29 as values. Display the resulting DataFrame afterwards.

In [5]:
df['fifth_column'] = [25, 26, 27, 28,29]
df

,zeroth_column,first_column,second_column,third_column,fourth_column,fifth_column
0,0,1,2,3,16,25
1,4,5,6,7,17,26
2,8,9,10,11,18,27
3,12,13,14,15,19,28
4,20,21,22,23,24,29

## The .loc[...] property

The `.loc[...]` property is a highly useful tool to access specific parts of a DataFrame. We use it all the time!

`.loc[...]` has two parts: `.loc[row_selection, column_selection]`, where the second part is optional. `row_selection` and `column_selection` can be all kinds of different ways of telling python which rows or columns we want to select.

**Tasks:**
1. Read through the `pandas.DataFrame.loc` documentation to understand how `.loc` works:  
   https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.loc.html

2. Use `.loc[start_index:end_index]` to display row number 1 until (including) row number 3 of the DataFrame.  
   *Careful:* When slicing a `list` the `end_index` is not included in the result. When slicing a `DataFrame` it is.

In [6]:
df.loc[[1,3]]

,zeroth_column,first_column,second_column,third_column,fourth_column,fifth_column
1,4,5,6,7,17,26
3,12,13,14,15,19,28

3. Use `.loc[start_index:]` to display row number 2 until the last row number of the DataFrame.

In [7]:
df.loc[2:]

,zeroth_column,first_column,second_column,third_column,fourth_column,fifth_column
2,8,9,10,11,18,27
3,12,13,14,15,19,28
4,20,21,22,23,24,29

4. Use `.loc[:end_index]` to display all rows until (including) row number 3 of the DataFrame

In [8]:
df.loc[:3]

,zeroth_column,first_column,second_column,third_column,fourth_column,fifth_column
0,0,1,2,3,16,25
1,4,5,6,7,17,26
2,8,9,10,11,18,27
3,12,13,14,15,19,28

5. Use `.loc[[row_index_1, row_index_2, ...]]` to display rows number 0, 3 and 4 of the DataFrame

In [9]:
df.loc[[0,3,4]]

,zeroth_column,first_column,second_column,third_column,fourth_column,fifth_column
0,0,1,2,3,16,25
3,12,13,14,15,19,28
4,20,21,22,23,24,29

6. Use `.loc[:, start_column:end_column]` to display all rows of the second_column to fourth_column of the DataFrame.  
   *Note:* Column names are given as strings and hence must be written in quotation marks.

In [10]:
df.loc[:,"second_column":"fourth_column"]

   second_column  third_column  fourth_column
0              2             3             16
1              6             7             17
2             10            11             18
3             14            15             19
4             22            23             24

7. Use `.iloc[:, start_column_index:end_column_index]` to do the same giving not the column names but column indices as numbers.  
   *Note:* `.loc` is for using column names, `.iloc` is for using column indices.  
   *Careful:* Slicing in `.iloc[...]` works differently from slicing in `.loc[...]`: like in `lists` the `end_index` is not included.

In [11]:
# info
df.iloc[:,3:5]

   third_column  fourth_column
0             3             16
1             7             17
2            11             18
3            15             19
4            23             24

In [12]:
df.iloc[:]

,zeroth_column,first_column,second_column,third_column,fourth_column,fifth_column
0,0,1,2,3,16,25
1,4,5,6,7,17,26
2,8,9,10,11,18,27
3,12,13,14,15,19,28
4,20,21,22,23,24,29

8. Use `.loc[...]` and `.iloc[...]` to display from the third_column until the last column of the DataFrame.

In [13]:
df.loc[:,"third_column":]

   third_column  fourth_column  fifth_column
0             3             16            25
1             7             17            26
2            11             18            27
3            15             19            28
4            23             24            29

In [14]:
df.iloc[:,:3]

   zeroth_column  first_column  second_column
0              0             1              2
1              4             5              6
2              8             9             10
3             12            13             14
4             20            21             22

9. Use `.loc[...]` and `.iloc[...]` to display all columns until (including) the fourth_column of the DataFrame.

In [15]:
df.loc[:,:"fifth_column"]

,zeroth_column,first_column,second_column,third_column,fourth_column,fifth_column
0,0,1,2,3,16,25
1,4,5,6,7,17,26
2,8,9,10,11,18,27
3,12,13,14,15,19,28
4,20,21,22,23,24,29

In [16]:
df.iloc[:,:5]

   zeroth_column  first_column  second_column  third_column  fourth_column
0              0             1              2             3             16
1              4             5              6             7             17
2              8             9             10            11             18
3             12            13             14            15             19
4             20            21             22            23             24

10. Use `.loc[...]` and `.iloc[...]` to display the zeroth_column, the third_column and the fourth_column of the DataFrame.

In [17]:
df.loc[:, ["zeroth_column", "third_column", "fourth_column"]]

   zeroth_column  third_column  fourth_column
0              0             3             16
1              4             7             17
2              8            11             18
3             12            15             19
4             20            23             24

In [18]:
df.iloc[:,[1,4,5]]

   first_column  fourth_column  fifth_column
0             1             16            25
1             5             17            26
2             9             18            27
3            13             19            28
4            21             24            29

11. Use `.loc[...]` to display row number 2 to 4 of the first_column and fourth_column of the DataFrame

In [19]:
df.loc[2:4,["first_column","fourth_column"]]

   first_column  fourth_column
2             9             18
3            13             19
4            21             24

## A First Real Dataset

Using test data is a bit boring. Let's use a real-world dataset to explore!  
We'll be looking at the 'Annual working hours vs. productivity, 2019' from https://ourworldindata.org/grapher/productivity-vs-annual-hours-worked.

**Task**:
To load the data directly into pandas, click on the 'Download' button below the chart, then on the 'Data' tab and scroll down to the 'Code examples' to find 'Python with Pandas'. Copy and execute the code to load the data into a DataFrame. If this produces an error (e.g., because the host is unreachable), download the data manually, upload the csv file here and use `df = pd.read_csv(...)` to load the data into a DataFrame. Afterwards display the DataFrame `df`.

In [20]:
import pandas as pd
import requests

# Fetch the data.
df = pd.read_csv("https://ourworldindata.org/grapher/productivity-vs-annual-hours-worked.csv?v=1&csvType=full&useColumnShortNames=true", storage_options = {'User-Agent': 'Our World In Data data fetch/1.0'})

# Fetch the metadata
metadata = requests.get("https://ourworldindata.org/grapher/productivity-vs-annual-hours-worked.metadata.json?v=1&csvType=full&useColumnShortNames=true").json()

In [21]:
df

,Entity,Code,Year,avh,productivity,population_historical,owid_region
0,Afghanistan,AFG,-10000,NaN,NaN,14737.0,NaN
1,Afghanistan,AFG,-9000,NaN,NaN,20405.0,NaN
2,Afghanistan,AFG,-8000,NaN,NaN,28253.0,NaN
3,Afghanistan,AFG,-7000,NaN,NaN,39120.0,NaN
4,Afghanistan,AFG,-6000,NaN,NaN,54166.0,NaN
...,...,...,...,...,...,...,...
58854,Zimbabwe,ZWE,2000,NaN,NaN,11892055.0,NaN
58855,Zimbabwe,ZWE,2001,NaN,NaN,11971904.0,NaN
58856,Zimbabwe,ZWE,2002,NaN,NaN,12087661.0,NaN
58857,Zimbabwe,ZWE,2003,NaN,NaN,12232324.0,NaN
58858,Zimbabwe,ZWE,2004,NaN,NaN,12365901.0,NaN

## Check Data Types

Different columns can have different data types. We most commonly have `int64` for whole numbers, `float64` for floating point numbers and `object` for texts, but other data types are possible as well.

**Task:** Check the data types of the columns by using `df.dtypes`.

In [22]:
df.dtypes

Entity                    object
Code                      object
Year                       int64
avh                      float64
productivity             float64
population_historical    float64
owid_region               object
dtype: object

## Check for Missing Values and Duplicates

Especially with real-world data, we often have missing or duplicated values, that we should check for before further investigating the data.

**Tasks:**  
1. Check for missing values using first `df.isnull()` and then `df.isnull().sum()`. What do you think the `.sum()` is summing up?

In [23]:
df.isnull()

,Entity,Code,Year,avh,productivity,population_historical,owid_region
0,False,False,False,True,True,False,True
1,False,False,False,True,True,False,True
2,False,False,False,True,True,False,True
3,False,False,False,True,True,False,True
4,False,False,False,True,True,False,True
...,...,...,...,...,...,...,...
58854,False,False,False,True,True,False,True
58855,False,False,False,True,True,False,True
58856,False,False,False,True,True,False,True
58857,False,False,False,True,True,False,True
58858,False,False,False,True,True,False,True

In [24]:
df.isnull().sum()
#  is summing up the header values

Entity                       0
Code                      3525
Year                         0
avh                      53894
productivity             53894
population_historical       35
owid_region              58587
dtype: int64

2. Use `df.info()` to display both the data types and the missing value counts at once.

In [25]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 58859 entries, 0 to 58858
Data columns (total 7 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Entity                 58859 non-null  object
 1   Code                   55334 non-null  object
 2   Year                   58859 non-null  int64
 3   avh                    4965 non-null   float64
 4   productivity           4965 non-null   float64
 5   population_historical  58824 non-null  float64
 6   owid_region            272 non-null    object
dtypes: float64(3), int64(1), object(3)
memory usage: 3.1+ MB

3. Check if there are duplicated rows using `df[df.duplicated(keep=False)]`.

In [26]:
df[df.duplicated(keep=False)]

Empty DataFrame
Columns: [Entity, Code, Year, avh, productivity, population_historical, owid_region]
Index: []

4. Check if you have more than one entry per entity using `df[df.duplicated(subset=["column1", "column2", ...], keep=False)]`.

In [27]:
df[df.duplicated(subset=["Entity","Code","Year","avh","productivity","population_historical","owid_region"], keep=False)]

Empty DataFrame
Columns: [Entity, Code, Year, avh, productivity, population_historical, owid_region]
Index: []

5. Check if you have more than one entry per entity per year.

In [28]:
df[df.duplicated(subset=["Year"],keep=False)]

,Entity,Code,Year,avh,productivity,population_historical,owid_region
0,Afghanistan,AFG,-10000,NaN,NaN,14737.0,NaN
1,Afghanistan,AFG,-9000,NaN,NaN,20405.0,NaN
2,Afghanistan,AFG,-8000,NaN,NaN,28253.0,NaN
3,Afghanistan,AFG,-7000,NaN,NaN,39120.0,NaN
4,Afghanistan,AFG,-6000,NaN,NaN,54166.0,NaN
...,...,...,...,...,...,...,...
58854,Zimbabwe,ZWE,2000,NaN,NaN,11892055.0,NaN
58855,Zimbabwe,ZWE,2001,NaN,NaN,11971904.0,NaN
58856,Zimbabwe,ZWE,2002,NaN,NaN,12087661.0,NaN
58857,Zimbabwe,ZWE,2003,NaN,NaN,12232324.0,NaN
58858,Zimbabwe,ZWE,2004,NaN,NaN,12365901.0,NaN

## Filtering

Often times we want to filter a DataFrame to only display rows and columns with specific values. This is done by using masks consisting of `True` and `False` for each entry in the DataFrame, as e.g. produced by `df.isnull()`, `df.duplicated()` or by using comparison operators `<`, `<=`, `==`, `>=`, `>`.

**Tasks:**  
1. There are some records in `Population (historical)` column missing. Use `df[df['column'].isnull()]` to display only rows with missing values in that column. Check which years these missing values are from.

In [29]:
df[df['population_historical'].isnull()]

,Entity,Code,Year,avh,productivity,population_historical,owid_region
599,Aland Islands,ALA,2023,NaN,NaN,NaN,Europe
3705,Austria-Hungary,OWID_AUH,2023,NaN,NaN,NaN,Europe
7515,British Indian Ocean Territory,IOT,2023,NaN,NaN,NaN,Asia
10785,Christmas Island,CXR,2023,NaN,NaN,NaN,Asia
10786,Cocos Islands,CCK,2023,NaN,NaN,NaN,Asia
13362,Czechoslovakia,OWID_CZS,2023,NaN,NaN,NaN,Europe
13624,Democratic Republic of Vietnam,NaN,2023,NaN,NaN,NaN,Asia
14664,Duchy of Modena and Reggio,NaN,2023,NaN,NaN,NaN,Europe
14665,Duchy of Parma and Piacenza,NaN,2023,NaN,NaN,NaN,Europe
14674,East Germany,OWID_GDR,2023,NaN,NaN,NaN,Europe
17072,Ethiopia (former),OWID_ERE,2023,NaN,NaN,NaN,Africa
17896,Federal Republic of Central America,NaN,2023,NaN,NaN,NaN,North America
20259,Grand Duchy of Baden,NaN,2023,NaN,NaN,NaN,Europe
20260,Grand Duchy of Tuscany,NaN,2023,NaN,NaN,NaN,Europe
20261,Great Colombia,NaN,2023,NaN,NaN,NaN,South America
26994,Kingdom of Bavaria,NaN,2023,NaN,NaN,NaN,Europe
26995,Kingdom of Sardinia,NaN,2023,NaN,NaN,NaN,Europe
26996,Kingdom of Saxony,NaN,2023,NaN,NaN,NaN,Europe
26997,Kingdom of Wurttemberg,NaN,2023,NaN,NaN,NaN,Europe
26998,Kingdom of the Two Sicilies,NaN,2023,NaN,NaN,NaN,Europe
27223,Korea (former),OWID_KRU,2023,NaN,NaN,NaN,Asia
36768,Netherlands Antilles,ANT,2023,NaN,NaN,NaN,North America
37991,Norfolk Island,NFK,2023,NaN,NaN,NaN,Oceania
39782,Orange Free State,NaN,2023,NaN,NaN,NaN,Africa
40044,Pakistan (former),NaN,2023,NaN,NaN,NaN,Asia
41798,Pitcairn,PCN,2023,NaN,NaN,NaN,Oceania
42701,Republic of Vietnam,OWID_RVN,2023,NaN,NaN,NaN,Asia
46282,Serbia and Montenegro,OWID_SRM,2023,NaN,NaN,NaN,Europe
48654,South Georgia and the South Sandwich Islands,SGS,2023,NaN,NaN,NaN,South America
49925,Sudan (former),NaN,2023,NaN,NaN,NaN,Africa
54292,USSR,OWID_USS,2023,NaN,NaN,NaN,Europe
57573,West Germany,OWID_GFR,2023,NaN,NaN,NaN,Europe
58234,Yemen Arab Republic,OWID_YAR,2023,NaN,NaN,NaN,Asia
58258,Yemen People's Republic,OWID_YPR,2023,NaN,NaN,NaN,Asia
58336,Yugoslavia,OWID_YGS,2023,NaN,NaN,NaN,Europe

2. Use `df[df['column']==value]` to only display rows where the entity has the value 'Germany'.

In [30]:
df[df['Entity']=="Germany"]

,Entity,Code,Year,avh,productivity,population_historical,owid_region
19661,Germany,DEU,1950,2427.40,5.398649,69847778.0,NaN
19662,Germany,DEU,1951,2401.56,5.926178,69782050.0,NaN
19663,Germany,DEU,1952,2376.01,6.420325,69826948.0,NaN
19664,Germany,DEU,1953,2350.72,6.878012,69935116.0,NaN
19665,Germany,DEU,1954,2325.70,7.326603,70104621.0,NaN
...,...,...,...,...,...,...,...
19917,Germany,DEU,1945,NaN,NaN,71376625.0,NaN
19918,Germany,DEU,1946,NaN,NaN,71225935.0,NaN
19919,Germany,DEU,1947,NaN,NaN,71075562.0,NaN
19920,Germany,DEU,1948,NaN,NaN,70925507.0,NaN
19921,Germany,DEU,1949,NaN,NaN,70888212.0,NaN

3. Use `df[(condition1)&(condition2)]` to apply two conditions that are linked with an 'and' (`&`) to  display rows where the entity is `Germany` and the productivity was higher than `50`.

In [31]:
df[(df['Entity']=="Germany") & (df["productivity"]>50)]

,Entity,Code,Year,avh,productivity,population_historical,owid_region
19706,Germany,DEU,1995,1528.90,50.687958,82019890.0,NaN
19707,Germany,DEU,1996,1515.50,51.823856,82263195.0,NaN
19708,Germany,DEU,1997,1506.16,53.603516,82389631.0,NaN
19709,Germany,DEU,1998,1503.01,54.964676,82011933.0,NaN
19710,Germany,DEU,1999,1490.27,57.002277,81678279.0,NaN
19711,Germany,DEU,2000,1464.53,58.083973,81797255.0,NaN
19712,Germany,DEU,2001,1457.35,59.583893,81933882.0,NaN
19713,Germany,DEU,2002,1448.34,60.345882,82068328.0,NaN
19714,Germany,DEU,2003,1443.07,62.535880,82111619.0,NaN
19715,Germany,DEU,2004,1442.65,63.894978,82092706.0,NaN
19716,Germany,DEU,2005,1431.89,67.481415,82046733.0,NaN
19717,Germany,DEU,2006,1452.42,67.916740,81701971.0,NaN
19718,Germany,DEU,2007,1453.86,70.651340,81298546.0,NaN
19719,Germany,DEU,2008,1446.89,71.665570,81110780.0,NaN
19720,Germany,DEU,2009,1406.77,68.887060,80935276.0,NaN
19721,Germany,DEU,2010,1425.37,70.998740,80830916.0,NaN
19722,Germany,DEU,2011,1427.18,74.035706,80857877.0,NaN
19723,Germany,DEU,2012,1406.00,73.760130,80916391.0,NaN
19724,Germany,DEU,2013,1395.73,73.892365,81041581.0,NaN
19725,Germany,DEU,2014,1400.01,75.671060,81376078.0,NaN
19726,Germany,DEU,2015,1401.59,74.099724,82077546.0,NaN
19727,Germany,DEU,2016,1395.83,76.029090,82760102.0,NaN
19728,Germany,DEU,2017,1388.21,78.195240,83104010.0,NaN
19729,Germany,DEU,2018,1380.72,78.599670,83368507.0,NaN
19730,Germany,DEU,2019,1372.04,81.118675,83559184.0,NaN
19731,Germany,DEU,2020,1313.57,82.040480,83628711.0,NaN
19732,Germany,DEU,2021,1341.88,82.909170,83697080.0,NaN
19733,Germany,DEU,2022,1340.14,82.747210,84086227.0,NaN
19734,Germany,DEU,2023,1335.27,82.501175,84548233.0,Europe

4. Use `df.loc[(condition1)&(condition2), ['column1', 'column2', ...]]` to show the same selection of the DataFrame, but only displaying the year, the productivity and the population.

In [32]:
df.loc[(df['Entity']=="Germany") & (df["productivity"]>50)],["year","productivity","population"]

(        Entity Code  Year      avh  productivity  population_historical  \
 19706  Germany  DEU  1995  1528.90     50.687958             82019890.0
 19707  Germany  DEU  1996  1515.50     51.823856             82263195.0
 19708  Germany  DEU  1997  1506.16     53.603516             82389631.0
 19709  Germany  DEU  1998  1503.01     54.964676             82011933.0
 19710  Germany  DEU  1999  1490.27     57.002277             81678279.0
 19711  Germany  DEU  2000  1464.53     58.083973             81797255.0
 19712  Germany  DEU  2001  1457.35     59.583893             81933882.0
 19713  Germany  DEU  2002  1448.34     60.345882             82068328.0
 19714  Germany  DEU  2003  1443.07     62.535880             82111619.0
 19715  Germany  DEU  2004  1442.65     63.894978             82092706.0
 19716  Germany  DEU  2005  1431.89     67.481415             82046733.0
 19717  Germany  DEU  2006  1452.42     67.916740             81701971.0
 19718  Germany  DEU  2007  1453.86     70.651340             81298546.0
 19719  Germany  DEU  2008  1446.89     71.665570             81110780.0
 19720  Germany  DEU  2009  1406.77     68.887060             80935276.0
 19721  Germany  DEU  2010  1425.37     70.998740             80830916.0
 19722  Germany  DEU  2011  1427.18     74.035706             80857877.0
 19723  Germany  DEU  2012  1406.00     73.760130             80916391.0
 19724  Germany  DEU  2013  1395.73     73.892365             81041581.0
 19725  Germany  DEU  2014  1400.01     75.671060             81376078.0
 19726  Germany  DEU  2015  1401.59     74.099724             82077546.0
 19727  Germany  DEU  2016  1395.83     76.029090             82760102.0
 19728  Germany  DEU  2017  1388.21     78.195240             83104010.0
 19729  Germany  DEU  2018  1380.72     78.599670             83368507.0
 19730  Germany  DEU  2019  1372.04     81.118675             83559184.0
 19731  Germany  DEU  2020  1313.57     82.040480             83628711.0
 19732  Germany  DEU  2021  1341.88     82.909170             83697080.0
 19733  Germany  DEU  2022  1340.14     82.747210             84086227.0
 19734  Germany  DEU  2023  1335.27     82.501175             84548233.0

       owid_region
 19706         NaN
 19707         NaN
 19708         NaN
 19709         NaN
 19710         NaN
 19711         NaN
 19712         NaN
 19713         NaN
 19714         NaN
 19715         NaN
 19716         NaN
 19717         NaN
 19718         NaN
 19719         NaN
 19720         NaN
 19721         NaN
 19722         NaN
 19723         NaN
 19724         NaN
 19725         NaN
 19726         NaN
 19727         NaN
 19728         NaN
 19729         NaN
 19730         NaN
 19731         NaN
 19732         NaN
 19733         NaN
 19734      Europe  ,
 ['year', 'productivity', 'population'])

5. Finally, display only the rows in which the 'United States' had a population of over 300 million, and of those, only the columns for the year and population.

In [33]:
df.loc[(df['Entity']=="United States") & (df["population_historical"]>300000000)],["year","population_historical"]

(              Entity Code  Year      avh  productivity  population_historical  \
 55394  United States  USA  2007  1828.84     68.141170            301844223.0
 55395  United States  USA  2008  1808.99     68.959710            304970325.0
 55396  United States  USA  2009  1764.89     71.023650            308023452.0
 55397  United States  USA  2010  1773.37     72.943100            311062785.0
 55398  United States  USA  2011  1782.51     72.994804            314105075.0
 55399  United States  USA  2012  1784.70     73.444336            317115349.0
 55400  United States  USA  2013  1791.31     74.135895            320110752.0
 55401  United States  USA  2014  1797.12     74.585940            323115377.0
 55402  United States  USA  2015  1808.72     74.986916            326126496.0
 55403  United States  USA  2016  1802.60     75.294950            329179423.0
 55404  United States  USA  2017  1795.58     76.112910            332204657.0
 55405  United States  USA  2018  1804.19     76.830710            335056492.0
 55406  United States  USA  2019  1796.65     77.742090            337790069.0
 55407  United States  USA  2020  1777.88     81.082470            339436156.0
 55408  United States  USA  2021  1788.70     82.302800            340161438.0
 55409  United States  USA  2022  1789.59     81.948240            341534041.0
 55410  United States  USA  2023  1788.88     83.531105            343477330.0

          owid_region
 55394            NaN
 55395            NaN
 55396            NaN
 55397            NaN
 55398            NaN
 55399            NaN
 55400            NaN
 55401            NaN
 55402            NaN
 55403            NaN
 55404            NaN
 55405            NaN
 55406            NaN
 55407            NaN
 55408            NaN
 55409            NaN
 55410  North America  ,
 ['year', 'population_historical'])

## Statistical Investigation

Let's do some basic statistics. DataFrames come with additional functions that we can use to calculate summarizing values, e.g.:  
`.describe()`, `.mean()`, `.median()`, `.mode()`, `.std()`, `.min()`, `.max()`, etc.

**Tasks:**
1. Use `df.describe()` function to get a first overview over the DataFrame.

In [34]:
df.describe()

               Year          avh  productivity  population_historical
count  58859.000000  4965.000000   4965.000000           5.882400e+04
mean    1614.151837  1995.158127     25.975767           5.088952e+07
std     1399.712614   320.842681     22.514652           3.003927e+08
min   -10000.000000  1313.570000      0.503521           1.000000e+00
25%     1833.000000  1742.450000      8.010024           1.479938e+05
50%     1902.000000  1979.930000     19.862648           1.409324e+06
75%     1967.000000  2232.000000     38.193000           6.787372e+06
max     2023.000000  3039.790000    175.478580           8.091735e+09

2. I often like to use `df.describe().T.apply(lambda x: x.apply('{0:g}'.format))`. It's a bit more complicated, but try it out. Which differences do you notice?

In [35]:
df.describe().T.apply(lambda x: x.apply('{0:g}'.format))

,count,mean,std,min,25%,50%,75%,max
Year,58859,1614.15,1399.71,-10000,1833,1902,1967,2023
avh,4965,1995.16,320.843,1313.57,1742.45,1979.93,2232,3039.79
productivity,4965,25.9758,22.5147,0.503521,8.01002,19.8626,38.193,175.479
population_historical,58824,5.08895e+07,3.00393e+08,1,147994,1.40932e+06,6.78737e+06,8.09173e+09

3. We can also apply summarizing functions to filtered DataFrames. For that first use `df.loc[condition, ['column1', 'column2', ...]]` to filter the DataFrame for rows where the entity is Germany and for  the columns `Productivity: output per hour worked` and `Population (historical)`. Then calculate the `.mean()` of the resulting DataFrame.

In [36]:
df.loc[(df['Entity']=="Germany"),["productivity","population_historical"]].mean()

productivity             4.035435e+01
population_historical    4.899437e+07
dtype: float64

4. In a similar way, find the first (i.e., 'minimum') year where Germany had a population over 80 million.

In [37]:
df.loc[(df['Entity'] == 'Germany') & (df['population_historical'] > 80000000),'Year'].min()

np.int64(1991)

5. Lastly, find the entity and year with the largest population in the DataFrame.

In [38]:
df.loc[(df['Entity'] == 'Germany') & (df['population_historical']),'Year'].max()

np.int64(2023)

---
*Hint:* Filter for the row where the population is equal to the maximum population.

---

## Investigating Categorical Features: Value Counts, (N)Unique

To investigate categorical features, we have a couple of useful functions.

**Tasks**:
1. Use `df['column'].value_counts()` on the `Entity` column of the DataFrame. What does this show you?

In [39]:
df['Entity'].value_counts()
# it shows me the value counts

Entity
Afghanistan                       261
Mongolia                          261
Lithuania                         261
Low-income countries              261
Lower-middle-income countries     261
                                 ...
Pitcairn                            1
Republic of Vietnam                 1
British Indian Ocean Territory      1
Austria-Hungary                     1
Orange Free State                   1
Name: count, Length: 294, dtype: int64

2. Use `df['column'].unique()` and `df['column'].nunique()` on the same column of the DataFrame. What do these show you?

In [40]:
df['Entity'].nunique()
# it tells us the total

294

In [41]:
df['Entity'].unique()
#this tells the countries

array(['Afghanistan', 'Africa', 'Africa (UN)', 'Akrotiri and Dhekelia',
       'Aland Islands', 'Albania', 'Algeria', 'American Samoa',
       'Americas (UN)', 'Andorra', 'Angola', 'Anguilla',
       'Antigua and Barbuda', 'Argentina', 'Armenia', 'Aruba', 'Asia',
       'Asia (UN)', 'Australia', 'Austria', 'Austria-Hungary',
       'Azerbaijan', 'Bahamas', 'Bahrain', 'Bangladesh', 'Barbados',
       'Belarus', 'Belgium', 'Belize', 'Benin', 'Bermuda', 'Bhutan',
       'Bolivia', 'Bonaire Sint Eustatius and Saba',
       'Bosnia and Herzegovina', 'Botswana', 'Brazil',
       'British Indian Ocean Territory', 'British Virgin Islands',
       'Brunei', 'Bulgaria', 'Burkina Faso', 'Burundi', 'Cambodia',
       'Cameroon', 'Canada', 'Cape Verde', 'Cayman Islands',
       'Central African Republic', 'Chad', 'Chile', 'China',
       'Christmas Island', 'Cocos Islands', 'Colombia', 'Comoros',
       'Congo', 'Cook Islands', 'Costa Rica', "Cote d'Ivoire", 'Croatia',
       'Cuba', 'Curacao', 'Cyprus', 'Czechia', 'Czechoslovakia',
       'Democratic Republic of Congo', 'Democratic Republic of Vietnam',
       'Denmark', 'Djibouti', 'Dominica', 'Dominican Republic',
       'Duchy of Modena and Reggio', 'Duchy of Parma and Piacenza',
       'East Germany', 'East Timor', 'Ecuador', 'Egypt', 'El Salvador',
       'Equatorial Guinea', 'Eritrea', 'Estonia', 'Eswatini', 'Ethiopia',
       'Ethiopia (former)', 'Europe', 'Europe (UN)',
       'European Union (27)', 'Falkland Islands', 'Faroe Islands',
       'Federal Republic of Central America', 'Fiji', 'Finland', 'France',
       'French Guiana', 'French Polynesia', 'Gabon', 'Gambia', 'Georgia',
       'Germany', 'Ghana', 'Gibraltar', 'Grand Duchy of Baden',
       'Grand Duchy of Tuscany', 'Great Colombia', 'Greece', 'Greenland',
       'Grenada', 'Guadeloupe', 'Guam', 'Guatemala', 'Guernsey', 'Guinea',
       'Guinea-Bissau', 'Guyana', 'Haiti', 'High-income countries',
       'Honduras', 'Hong Kong', 'Hungary', 'Iceland', 'India',
       'Indonesia', 'Iran', 'Iraq', 'Ireland', 'Ireland (whole island)',
       'Isle of Man', 'Israel', 'Italy', 'Jamaica', 'Japan', 'Jersey',
       'Jordan', 'Kazakhstan', 'Kenya', 'Kingdom of Bavaria',
       'Kingdom of Sardinia', 'Kingdom of Saxony',
       'Kingdom of Wurttemberg', 'Kingdom of the Two Sicilies',
       'Kiribati', 'Korea (former)', 'Kosovo', 'Kuwait', 'Kyrgyzstan',
       'Laos', 'Latin America and the Caribbean (UN)', 'Latvia',
       'Lebanon', 'Lesotho', 'Liberia', 'Libya', 'Liechtenstein',
       'Lithuania', 'Low-income countries',
       'Lower-middle-income countries', 'Luxembourg', 'Macao',
       'Madagascar', 'Malawi', 'Malaysia', 'Maldives', 'Mali', 'Malta',
       'Marshall Islands', 'Martinique', 'Mauritania', 'Mauritius',
       'Mayotte', 'Mexico', 'Micronesia (country)', 'Moldova', 'Monaco',
       'Mongolia', 'Montenegro', 'Montserrat', 'Morocco', 'Mozambique',
       'Myanmar', 'Namibia', 'Nauru', 'Nepal', 'Netherlands',
       'Netherlands Antilles', 'New Caledonia', 'New Zealand',
       'Nicaragua', 'Niger', 'Nigeria', 'Niue', 'Norfolk Island',
       'North America', 'North Korea', 'North Macedonia',
       'Northern America (UN)', 'Northern Mariana Islands', 'Norway',
       'Oceania', 'Oceania (UN)', 'Oman', 'Orange Free State', 'Pakistan',
       'Pakistan (former)', 'Palau', 'Palestine', 'Panama',
       'Papua New Guinea', 'Paraguay', 'Peru', 'Philippines', 'Pitcairn',
       'Poland', 'Portugal', 'Puerto Rico', 'Qatar',
       'Republic of Vietnam', 'Reunion', 'Romania', 'Russia', 'Rwanda',
       'Saint Barthelemy', 'Saint Helena', 'Saint Kitts and Nevis',
       'Saint Lucia', 'Saint Martin (French part)',
       'Saint Pierre and Miquelon', 'Saint Vincent and the Grenadines',
       'Samoa', 'San Marino', 'Sao Tome and Principe', 'Saudi Arabia',
       'Senegal', 'Serbia', 'Serbia and Montenegro', 'Seychelles',
       'Sierra Leone', 'Singapore', 'Sint Maarten (Dutch part)',
       'Slovakia', 'Slovenia', 'Solomon Islands', 'Somalia',
       'South Africa', 'South America',
       'South Georgia and the South Sandwich Islands', 'South Korea',
       'South Sudan', 'Spain', 'Sri Lanka', 'Sudan', 'Sudan (former)',
       'Suriname', 'Svalbard and Jan Mayen', 'Sweden', 'Switzerland',
       'Syria', 'Taiwan', 'Tajikistan', 'Tanzania', 'Thailand', 'Togo',
       'Tokelau', 'Tonga', 'Trinidad and Tobago', 'Tunisia', 'Turkey',
       'Turkmenistan', 'Turks and Caicos Islands', 'Tuvalu', 'USSR',
       'Uganda', 'Ukraine', 'United Arab Emirates', 'United Kingdom',
       'United States', 'United States Virgin Islands',
       'Upper-middle-income countries', 'Uruguay', 'Uzbekistan',
       'Vanuatu', 'Vatican', 'Venezuela', 'Vietnam', 'Wallis and Futuna',
       'West Germany', 'Western Sahara', 'World', 'Yemen',
       'Yemen Arab Republic', "Yemen People's Republic", 'Yugoslavia',
       'Zambia', 'Zimbabwe'], dtype=object)

3. Find out how many different years of data you have in the DataFrame.

In [42]:
df['Year'].nunique()

265

4. For which year do you have the most data, and for which years do you have the least?

In [43]:
# Count number of rows per year
year_counts = df['Year'].value_counts()

# Year with the most data
most_data_year = year_counts.idxmax()
most_data_count = year_counts.max()

# Year(s) with the least data (there could be ties)
least_data_count = year_counts.min()
least_data_years = year_counts[year_counts == least_data_count].index.tolist()

print(f"Year with the most data: {most_data_year} ({most_data_count} records)")
print(f"Year(s) with the least data: {least_data_years} ({least_data_count} records each)")

Year with the most data: 2023 (292 records)
Year(s) with the least data: [1788, 1555, 1640, 1785] (1 records each)

5. How many different years of data do you have from Germany?

In [44]:
# Filter data for Germany
germany_data = df.loc[df["Entity"] == "Germany"]

# Count unique years in the filtered data
num_years_germany = germany_data['Year'].nunique()

print(f"Number of different years of data from Germany: {num_years_germany}")

# Short version
# df.loc[df['Entity'] == 'Germany', 'Year'].nunique()

Number of different years of data from Germany: 261

6. Filter for rows in which the column World regions according to OWID has the entry Europe and use `.unique()` to find which states belong to Europe. Save the result in a variable called `states_europe`.

In [45]:
states_europe = df.loc[df['owid_region'] == 'Europe', 'Entity'].unique()
print(states_europe)

['Aland Islands' 'Albania' 'Andorra' 'Austria' 'Austria-Hungary' 'Belarus'
 'Belgium' 'Bosnia and Herzegovina' 'Bulgaria' 'Croatia' 'Cyprus'
 'Czechia' 'Czechoslovakia' 'Denmark' 'Duchy of Modena and Reggio'
 'Duchy of Parma and Piacenza' 'East Germany' 'Estonia' 'Faroe Islands'
 'Finland' 'France' 'Germany' 'Gibraltar' 'Grand Duchy of Baden'
 'Grand Duchy of Tuscany' 'Greece' 'Guernsey' 'Hungary' 'Iceland'
 'Ireland' 'Isle of Man' 'Italy' 'Jersey' 'Kingdom of Bavaria'
 'Kingdom of Sardinia' 'Kingdom of Saxony' 'Kingdom of Wurttemberg'
 'Kingdom of the Two Sicilies' 'Kosovo' 'Latvia' 'Liechtenstein'
 'Lithuania' 'Luxembourg' 'Malta' 'Moldova' 'Monaco' 'Montenegro'
 'Netherlands' 'North Macedonia' 'Norway' 'Poland' 'Portugal' 'Romania'
 'Russia' 'San Marino' 'Serbia' 'Serbia and Montenegro' 'Slovakia'
 'Slovenia' 'Spain' 'Sweden' 'Switzerland' 'USSR' 'Ukraine'
 'United Kingdom' 'Vatican' 'West Germany' 'Yugoslavia']

## GroupBy

To create more advanced aggregated statistics, we can use the `.groupby()` function. It looks like this: `df.groupby('column1')['column2'].statistical_function()`, which means: "For each unique value in column1 calculate the statistical_function with regard to column2.".

For example, to get the mean productivity per entity, we can use:  
`df.groupby('Entity')['Productivity: output per hour worked'].mean()`

**Task:**
1. Calculate the maximum population per entity.

In [46]:
df.groupby("Entity")["population_historical"].max()

Entity
Afghanistan                4.145476e+07
Africa                     1.480771e+09
Africa (UN)                1.480771e+09
Akrotiri and Dhekelia      1.570000e+04
Aland Islands                       NaN
                               ...
Yemen Arab Republic        9.632000e+06
Yemen People's Republic    2.681000e+06
Yugoslavia                 2.309000e+07
Zambia                     2.072397e+07
Zimbabwe                   1.634083e+07
Name: population_historical, Length: 294, dtype: float64

2. Calculate the average population for each year.

In [47]:
df.groupby("Entity")["population_historical"].mean()

Entity
Afghanistan                8.085438e+06
Africa                     2.693496e+08
Africa (UN)                6.722211e+08
Akrotiri and Dhekelia      1.170333e+04
Aland Islands                       NaN
                               ...
Yemen Arab Republic        6.326913e+06
Yemen People's Republic    1.845426e+06
Yugoslavia                 1.669473e+07
Zambia                     3.261771e+06
Zimbabwe                   3.251376e+06
Name: population_historical, Length: 294, dtype: float64

3. Calculate the average population of Europe for each year.

In [59]:
europe_df = df[df['Entity'].isin(states_europe)]
# Group the filtered European data by 'Year'.
# Then, select the 'population_historical' column and calculate the mean for each year.
avg_population_per_year = europe_df.groupby('Year')['population_historical'].mean()

print(avg_population_per_year)

Year
-10000    2.947624e+04
-9000     3.505859e+04
-8000     4.193759e+04
-7000     4.934317e+04
-6000     6.092983e+04
              ...
 2019     1.472139e+07
 2020     1.472209e+07
 2021     1.470453e+07
 2022     1.467247e+07
 2023     1.464604e+07
Name: population_historical, Length: 261, dtype: float64

---
*Hint:* Use the previously saved list `states_europe` and the function `.isin()`, e.g. `df['column'].isin(my_list)`, to filter.

---

## Sorting

We can sort a DataFrame by specific columns using the `.sort_values(by='column', ascending=True/False)` function or based on the index using the `.sort_index(ascending=True/False)` function and can display the top n by using `.head(n)` or the bottom n by using `.tail(n)`.

Hi

**Tasks:**
1. Display the whole DataFrame sorted by population, descending. From that result only display the top 5 entries.

In [49]:
df

,Entity,Code,Year,avh,productivity,population_historical,owid_region
0,Afghanistan,AFG,-10000,NaN,NaN,14737.0,NaN
1,Afghanistan,AFG,-9000,NaN,NaN,20405.0,NaN
2,Afghanistan,AFG,-8000,NaN,NaN,28253.0,NaN
3,Afghanistan,AFG,-7000,NaN,NaN,39120.0,NaN
4,Afghanistan,AFG,-6000,NaN,NaN,54166.0,NaN
...,...,...,...,...,...,...,...
58854,Zimbabwe,ZWE,2000,NaN,NaN,11892055.0,NaN
58855,Zimbabwe,ZWE,2001,NaN,NaN,11971904.0,NaN
58856,Zimbabwe,ZWE,2002,NaN,NaN,12087661.0,NaN
58857,Zimbabwe,ZWE,2003,NaN,NaN,12232324.0,NaN
58858,Zimbabwe,ZWE,2004,NaN,NaN,12365901.0,NaN

In [50]:
sorted_five = df.sort_values(by=['population_historical'], ascending=False)
sorted_five.head(5)

,Entity,Code,Year,avh,productivity,population_historical,owid_region
57949,World,OWID_WRL,2023,NaN,NaN,8.091735e+09,NaN
57948,World,OWID_WRL,2022,NaN,NaN,8.021407e+09,NaN
57947,World,OWID_WRL,2021,NaN,NaN,7.954448e+09,NaN
57946,World,OWID_WRL,2020,NaN,NaN,7.887001e+09,NaN
57945,World,OWID_WRL,2019,NaN,NaN,7.811294e+09,NaN

2. Using the results of `.groupby()` function from before, show the top 20 entities in terms of population.

In [57]:
avg_population_per_year

Year
-10000    2.947624e+04
-9000     3.505859e+04
-8000     4.193759e+04
-7000     4.934317e+04
-6000     6.092983e+04
              ...
 2019     1.472139e+07
 2020     1.472209e+07
 2021     1.470453e+07
 2022     1.467247e+07
 2023     1.464604e+07
Name: population_historical, Length: 261, dtype: float64

In [70]:
avgs = avg_population_per_year.sort_values(ascending=False)

avgs.head(20)

Year
1990    2.006403e+07
1991    1.943086e+07
1989    1.926278e+07
1988    1.915920e+07
1987    1.904452e+07
1986    1.892857e+07
1985    1.881719e+07
1984    1.871354e+07
1983    1.861031e+07
1982    1.850744e+07
1981    1.840810e+07
1980    1.830384e+07
1973    1.827611e+07
1979    1.819568e+07
1978    1.808699e+07
1977    1.797305e+07
1976    1.785558e+07
1975    1.774108e+07
1974    1.762666e+07
1972    1.738131e+07
Name: population_historical, dtype: float64

3. Finally, display how the average population in Europe has changed over the last 30 years.

In [71]:
avg_population_per_year.tail(30)

Year
1994    1.423229e+07
1995    1.424260e+07
1996    1.424218e+07
1997    1.424219e+07
1998    1.422981e+07
1999    1.421569e+07
2000    1.421321e+07
2001    1.421352e+07
2002    1.422978e+07
2003    1.425320e+07
2004    1.426942e+07
2005    1.428433e+07
2006    1.429614e+07
2007    1.441116e+07
2008    1.444394e+07
2009    1.447148e+07
2010    1.449556e+07
2011    1.451972e+07
2012    1.454166e+07
2013    1.456186e+07
2014    1.458515e+07
2015    1.461680e+07
2016    1.465177e+07
2017    1.468007e+07
2018    1.470266e+07
2019    1.472139e+07
2020    1.472209e+07
2021    1.470453e+07
2022    1.467247e+07
2023    1.464604e+07
Name: population_historical, dtype: float64